<a href="https://colab.research.google.com/github/vikadenisova/OpenDS_homework/blob/main/OpenDS_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


<img src="../../img/ods_stickers.jpg">

## <center> [mlcourse.ai](https://mlcourse.ai) – открытый курс OpenDataScience по машинному обучению 

Автор материала: Юрий Кашницкий (@yorko в Slack ODS). Материал распространяется на условиях лицензии [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/). Можно использовать в любых целях (редактировать, поправлять и брать за основу), кроме коммерческих, но с обязательным упоминанием автора материала.

# <center>Домашнее задание № 1 (демо).<br> Анализ данных по доходу населения UCI Adult</center>

**В задании предлагается с помощью Pandas ответить на несколько вопросов по данным репозитория UCI [Adult](https://archive.ics.uci.edu/ml/datasets/Adult) (качать данные не надо – они уже есть в репозитории). Для отправки решений используйте [онлайн-форму](https://docs.google.com/forms/d/1xAzU-5N6oEeR4UG8G44V6XL-Kbr4WYcPBG45Kijge2Y).**

Уникальные значения признаков (больше информации по ссылке выше):
- age: continuous.
- workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- fnlwgt: continuous.
- education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- education-num: continuous.
- marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- sex: Female, Male.
- capital-gain: continuous.
- capital-loss: continuous.
- hours-per-week: continuous.
- native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.   
- salary: >50K,<=50K

In [4]:
import pandas as pd

In [5]:
data = pd.read_csv("https://github.com/Yorko/mlcourse.ai/raw/master/data/adult.data.csv")
data.head()

   age         workclass  fnlwgt  ... hours-per-week  native-country salary
0   39         State-gov   77516  ...             40   United-States  <=50K
1   50  Self-emp-not-inc   83311  ...             13   United-States  <=50K
2   38           Private  215646  ...             40   United-States  <=50K
3   53           Private  234721  ...             40   United-States  <=50K
4   28           Private  338409  ...             40            Cuba  <=50K

[5 rows x 15 columns]

In [133]:
data.shape

(32561, 15)

**1. Сколько мужчин и женщин (признак *sex*) представлено в этом наборе данных?**

In [37]:
data.sex.value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

**2. Каков средний возраст (признак *age*) женщин?**

In [130]:
data[data.sex == 'Female'].age.mean()

36.85823043357163

**3. Какова доля граждан Германии (признак *native-country*)?**

In [17]:
data['native-country'].unique()

array(['United-States', 'Cuba', 'Jamaica', 'India', '?', 'Mexico',
       'South', 'Puerto-Rico', 'Honduras', 'England', 'Canada', 'Germany',
       'Iran', 'Philippines', 'Italy', 'Poland', 'Columbia', 'Cambodia',
       'Thailand', 'Ecuador', 'Laos', 'Taiwan', 'Haiti', 'Portugal',
       'Dominican-Republic', 'El-Salvador', 'France', 'Guatemala',
       'China', 'Japan', 'Yugoslavia', 'Peru',
       'Outlying-US(Guam-USVI-etc)', 'Scotland', 'Trinadad&Tobago',
       'Greece', 'Nicaragua', 'Vietnam', 'Hong', 'Ireland', 'Hungary',
       'Holand-Netherlands'], dtype=object)

In [135]:
data[data['native-country']=='Germany']['native-country'].count() / (data['native-country'].count()) *100

0.42074874850281013

**4-5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год? **

In [23]:
data.groupby(['salary'])['age'].describe(percentiles=[])

          count       mean        std   min   50%   max
salary
<=50K   24720.0  36.783738  14.020088  17.0  34.0  90.0
>50K     7841.0  44.249841  10.519028  19.0  44.0  90.0

**6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [26]:
pd.crosstab(data['salary'], data['education'], normalize=True)

education      10th      11th      12th  ...  Preschool  Prof-school  Some-college
salary                                   ...
<=50K      0.026750  0.034243  0.012285  ...   0.001566     0.004699      0.181321
>50K       0.001904  0.001843  0.001013  ...   0.000000     0.012991      0.042597

[2 rows x 16 columns]

In [36]:
data.pivot_table(['salary'], 
['education'], aggfunc='count')

              salary
education
10th             933
11th            1175
12th             433
1st-4th          168
5th-6th          333
7th-8th          646
9th              514
Assoc-acdm      1067
Assoc-voc       1382
Bachelors       5355
Doctorate        413
HS-grad        10501
Masters         1723
Preschool         51
Prof-school      576
Some-college    7291

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Amer-Indian-Eskimo*.**

In [38]:
data.groupby(['race'])['age'].describe(percentiles=[])

                      count       mean        std   min   50%   max
race
Amer-Indian-Eskimo    311.0  37.173633  12.447130  17.0  35.0  82.0
Asian-Pac-Islander   1039.0  37.746872  12.825133  17.0  36.0  90.0
Black                3124.0  37.767926  12.759290  17.0  36.0  90.0
Other                 271.0  33.457565  11.538865  17.0  31.0  77.0
White               27816.0  38.769881  13.782306  17.0  37.0  90.0

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [60]:
pd.crosstab(data['marital-status'], data['salary'])

salary                 <=50K  >50K
marital-status
Divorced                3980   463
Married-AF-spouse         13    10
Married-civ-spouse      8284  6692
Married-spouse-absent    384    34
Never-married          10192   491
Separated                959    66
Widowed                  908    85

In [92]:
sum_married = data[(data.salary=='>50K') & (data['marital-status']=='Married-AF-spouse')]['age'].count()+ data[(data.salary=='>50K') & (data['marital-status']=='Married-civ-spouse')]['age'].count() + data[(data.salary=='>50K') & (data['marital-status']=='Married-spouse-absent')]['age'].count()

In [94]:
sum_not_married = data[(data.salary=='>50K') & (data['marital-status']!='Married-AF-spouse') & (data['marital-status']!='Married-spouse-absent') & (data['marital-status']!='Married-civ-spouse')]['age'].count()

In [95]:
sum_married/sum_not_married

6.095927601809954

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [104]:
data['hours-per-week'].max()

99

In [110]:
data[data['hours-per-week'] == data['hours-per-week'].max()]['age'].count()

85

In [113]:
data[(data['hours-per-week'] == data['hours-per-week'].max()) & (data.salary=='>50K')]['age'].count() / (data[data['hours-per-week'] == data['hours-per-week'].max()]['age'].count()) *100

29.411764705882355

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [137]:
df = data.groupby(['native-country', 'salary'], as_index=False).agg({'hours-per-week' : 'mean'})

In [139]:
df[df['native-country'] == 'Japan']

   native-country salary  hours-per-week
47          Japan  <=50K       41.000000
48          Japan   >50K       47.958333